InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/Core/NVIC/Peripheral/Register/xHeader/NVIC_RegisterPeripheral.h
/********************************************************************************************/
/************************************* IPR18 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR18    (((IPR18_t*) (NVIC_BASE + NVIC_IPR18_OFFSET)))
#define NVIC_IPR18_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR18_OFFSET)))

/********************************************************************************************/
/************************************* IPR19 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR19    (((IPR19_t*) (NVIC_BASE + NVIC_IPR19_OFFSET)))
#define NVIC_IPR19_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR19_OFFSET)))

/********************************************************************************************/
/************************************* IPR20 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR20    (((IPR20_t*) (NVIC_BASE + NVIC_IPR20_OFFSET)))
#define NVIC_IPR20_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR20_OFFSET)))

/********************************************************************************************/
/************************************* IPR21 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR21    (((IPR21_t*) (NVIC_BASE + NVIC_IPR21_OFFSET)))
#define NVIC_IPR21_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR21_OFFSET)))

/********************************************************************************************/
/************************************* IPR22 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR22    (((IPR22_t*) (NVIC_BASE + NVIC_IPR22_OFFSET)))
#define NVIC_IPR22_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR22_OFFSET)))

/********************************************************************************************/
/************************************* IPR23 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR23    (((IPR23_t*) (NVIC_BASE + NVIC_IPR23_OFFSET)))
#define NVIC_IPR23_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR23_OFFSET)))

/********************************************************************************************/
/************************************* IPR24 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR24    (((IPR24_t*) (NVIC_BASE + NVIC_IPR24_OFFSET)))
#define NVIC_IPR24_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR24_OFFSET)))

/********************************************************************************************/
/************************************* IPR25 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR25    (((IPR25_t*) (NVIC_BASE + NVIC_IPR25_OFFSET)))
#define NVIC_IPR25_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR25_OFFSET)))

/********************************************************************************************/
/************************************* IPR26 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR26    (((IPR26_t*) (NVIC_BASE + NVIC_IPR26_OFFSET)))
#define NVIC_IPR26_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR26_OFFSET)))

/********************************************************************************************/
/************************************* IPR27 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR27    (((IPR27_t*) (NVIC_BASE + NVIC_IPR27_OFFSET)))
#define NVIC_IPR27_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR27_OFFSET)))

/********************************************************************************************/
/************************************* IPR28 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR28    (((IPR28_t*) (NVIC_BASE + NVIC_IPR28_OFFSET)))
#define NVIC_IPR28_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR28_OFFSET)))

/********************************************************************************************/
/************************************* IPR29 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR29    (((IPR29_t*) (NVIC_BASE + NVIC_IPR29_OFFSET)))
#define NVIC_IPR29_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR29_OFFSET)))

/********************************************************************************************/
/************************************* IPR30 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR30    (((IPR30_t*) (NVIC_BASE + NVIC_IPR30_OFFSET)))
#define NVIC_IPR30_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR30_OFFSET)))

/********************************************************************************************/
/************************************* IPR31 ***********************************************/
/******************************************************************************************/
#define NVIC_IPR31    (((IPR31_t*) (NVIC_BASE + NVIC_IPR31_OFFSET)))
#define NVIC_IPR31_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_IPR31_OFFSET)))

/********************************************************************************************/
/************************************* STIR ***********************************************/
/******************************************************************************************/
#define NVIC_STIR    (((STIR_t*) (NVIC_BASE + NVIC_STIR_OFFSET)))
#define NVIC_STIR_R    (*((volatile uint32_t*) (NVIC_BASE + NVIC_STIR_OFFSET)))

uintptr_t NVIC__uptrBlockBaseAddress(NVIC_nMODULE enModuleArg);


#endif /* XDRIVER_MCU_DRIVER_HEADER_NVIC_NVIC_PERIPHERAL_NVIC_REGISTER_NVIC_REGISTERPERIPHERAL_H_ */
